export default {
  'header.home': 'Главная',
  'header.blog': 'Блог',
  'header.about': 'Информация',
  'hero.title': 'Kirill zeRET',
  'hero.description': 'персональная страница web-разработчика',
  'about.kirill': 'Кирилл',
  'about.dev': 'Fullstack-разработчик',
  'about.main': 'Разрабатываю веб приложения',
  'about.libs':
    'Знаком с технологиями: TypeScript, React.JS, Next.JS, Redux, Redux ToolKit, Tanstak Query, Tanstak Router, Effector, Material UI, Mantine, Bootstrap, Styled Components, Formik, Yup, Zod, Prisma, Nest.JS, Express.',
  'about.also':
    'Также изучал/применял: Svelte, Astro, Python, Flask, Go, Supabase, Firebase, SQL, MongoDB, ChatGPT',
  'about.hobbies': 'Хобби',
  'about.hobbies.text':
    'В свободное время люблю играть в игры, чаще всего в жанре RPG. Увлекшись авиацией, много времени провел в авиасимуляторах и сетях для любителей виртуальной авицаии, где выполнял полеты в качестве пилота и обслуживал воздушное пространство в качестве диспетчера, сдал диспетчерский экзамен в сети IVAO.',
  'about.bio': 'Биография',
  'about.bio.text':
    'Разработкой увлекся когда начал посещать первые уроки информатики. Тогда нам преподавали Pascal.ABC. На этом языке я написал свои первые программы, которые представляли из себя калькуляторы, помогавшие мне при решение математических задач, что не очень нравилось моему преподавателю математики xD',
  'about.bio.text2':
    'После того как доступ к интернету упростился и у меня впервые появился собственный ноутбук, я стал интересоваться устройством веб-сайтов. Первый мой сайт был написан на основе фреймворка Flask для python, и представлял несколько страниц, текст на которые выводился из текстовых файлов. Исходники этого сайта к сожалению утеряны в веках',
  'about.bio.text3':
    'Позже я решил, что буду развиваться в направлении фронтенд разработки и начал изучать React. Немного разобравшись я присоединился к команде по разработке веб интерфейсов для русскоговорящего дивизиона сети IVAO, где познакомился с современными концепциями разроботки, и принципами работы в команде.',
  'about.projects.title': 'Проекты',
  'about.projects.position': 'Должность',
  'about.projects.front': 'Frontend-разработчик',
  'about.projects.full': 'Fullstack-разработчик',
  'about.projects.stack': 'Стэк технологий',
  'about.projects.tours.description':
    'Система используется руководством для публикации дивизионных туров и отслеживания прогресса выполнения этапов тура пользователями сети IVAO.\n' +
    'Руководство дивизиона может опубликовать новые туры, рассматривать отчеты о выполнении очередного этапа, и назначать награды для пользователей выполнивших все условия для получения.\n' +
    'Пользователь может видеть активные туры и описание их этапов, оставлять отчеты о выполнении отдельных этапов, знакомиться со своим прогрессом и сравнивать его со статистикой других пользователей.',
  'about.projects.plandi.description':
    'Сайт для проектировщиков архитекторов и инженеров. Пользователи могут найти работу, опубликовать свои вакансии или заказы для фрилансеров. Проектировщики и инженеры имеют возможность опубликовать и продавать свои проекты и модели. На проекте также доступен сервис "Онлайн офис", который дает командам интерфейс для управления проектом, с канбан доской и отображением задач на диаграмме Гантта. Администрация и пользователи сайта также могут создавать записи для блога.',
  'meta.main.description': 'персональная страница web-разработчика',
  'meta.about.title': 'Информация о разработчике',
  'meta.blog.title': 'Блог разработчика',
  'meta.blog.description': 'Разработчик делится своими мыслями о разных штуках',
  'tech.wip': 'Этот раздел находится в разработке',
  'tech.notFound.title': 'Страница не найдена',
  'tech.notFound.link': 'Вернуться на главную',
  'tech.notFound.author': 'Автор изображения',
  'button.more': 'Больше',
} as const
